app/controllers/pins_controller.rb

  def create
    @pin = Pin.new(pin_params)

    respond_to do |format|
      if @pin.save
---
INSERT INTO "pins" ("photo", "description", "created_at", "updated_at", "name", "user_id") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @pin.update(pin_params)
---
UPDATE "pins" SET "photo" = ?, "description" = ?, "name" = ?, "user_id" = ?, "updated_at" = ? WHERE "pins"."id" = ?  [["photo", "https://es-la.facebook.com/"], ["description", "Ingresa a Facebook"], ["name", "Facebook"], ["user_id", 2], ["updated_at", 2018-02-10 16:54:15 UTC], ["id", 2]]

    def set_pin
      @pin = Pin.find(params[:id])
---
SELECT  "pins".* FROM "pins" WHERE "pins"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]